ziyiz/DIY-Sim-Racing-FFB-Pedal-Customed/ESP32_master/src/Main.cpp
bool dap_action_update= false;
#include "MovingAverageFilter.h"
MovingAverageFilter rssi_filter(30);
int32_t joystickNormalizedToInt32_local = 0;
unsigned long pedal_last_update[3]={1,1,1};
uint8_t pedal_avaliable[3]={0,0,0};
uint8_t LED_Status=0; //0=normal 1= pairing
void ESPNOW_SyncTask( void * pvParameters);
void Joystick_Task( void * pvParameters);
void LED_Task( void * pvParameters);
void Serial_Task( void * pvParameters);
void LED_Task_Dongle( void * pvParameters);
void FanatecUpdate(void * pvParameters);

#ifdef Fanatec_comunication
  FanatecInterface fanatec(Fanatec_serial_RX, Fanatec_serial_TX, Fanatec_plug); // RX: GPIO18, TX: GPIO17, PLUG: GPIO16
#endif

/**********************************************************************************************/
/*                                                                                            */
/*                         setup function                                                     */
/*                                                                                            */
/**********************************************************************************************/

void setup()
{
  //Serial.begin(115200);
  //Serial.begin(921600);
  //Serial.begin(512000);
  //
  

  #if PCB_VERSION == 5||PCB_VERSION == 6||PCB_VERSION == 7
    //Serial.setTxTimeoutMs(0);
    Serial.setRxBufferSize(1024);
    Serial.setTimeout(5);
    Serial.begin(3000000);
    
    //Serial0.begin(921600);
    //Serial0.setDebugOutput(false);
    //esp_log_level_set("*",ESP_LOG_INFO);
  #else
    Serial.setRxBufferSize(1024);
    Serial.begin(921600);
    Serial.setTimeout(5);
    
  #endif
  #ifdef USB_JOYSTICK
	SetupController();
  #endif
  Serial.println(" ");
  Serial.println(" ");
  Serial.println(" ");
  
  Serial.println("[L]This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.");
  Serial.println("[L]Please check github repo for more detail: https://github.com/ChrGri/DIY-Sim-Racing-FFB-Pedal");


  // setup multi tasking
  /*
  semaphore_updateJoystick = xSemaphoreCreateMutex();
  semaphore_updateConfig = xSemaphoreCreateMutex();
  semaphore_resetServoPos = xSemaphoreCreateMutex();
  semaphore_updatePedalStates = xSemaphoreCreateMutex();
  */
  delay(10);
  //button read setup
  pinMode(Pairing_GPIO, INPUT_PULLUP);
  EEPROM.begin(256);
/*
  if(semaphore_updateJoystick==NULL)
  {
    Serial.println("Could not create semaphore");
    ESP.restart();
  }
  if(semaphore_updateConfig==NULL)
  {
    Serial.println("Could not create semaphore");
    ESP.restart();
  }
  */

  disableCore0WDT();
  //enable ESP-NOW
  ESPNow_initialize();
  //ESPNow multi-tasking    
  xTaskCreatePinnedToCore(
                        ESPNOW_SyncTask,   
                        "ESPNOW_update_Task", 
                        10000,  
                        //STACK_SIZE_FOR_TASK_2,    
                        NULL,      
                        1,         
                        &Task1,    
                        0);     
  delay(500);
  //Serial multitasking
  xTaskCreatePinnedToCore(
                        Serial_Task,   
                        "Serial_update_Task", 
                        5000,  
                        //STACK_SIZE_FOR_TASK_2,    
                        NULL,      
                        1,         
                        &Task4,    
                        1);     
  delay(500);

  xTaskCreatePinnedToCore(
                        Joystick_Task,   
                        "Joystick_update_Task", 
                        10000,  
                        //STACK_SIZE_FOR_TASK_2,    
                        NULL,      
                        1,         
                        &Task2,    
                        1);     
  delay(500);


  #ifdef Using_MCP4728
    MCP4728_I2C.begin(MCP_SDA,MCP_SCL,400000);
    uint8_t i2c_address[8]={0x60,0x61,0x62,0x63,0x64,0x65,0x66,0x67};
    int index_address=0;
    int found_address=0;
    int error;
    for(index_address=0;index_address<8;index_address++)
    {
      MCP4728_I2C.beginTransmission(i2c_address[index_address]);
      error = MCP4728_I2C.endTransmission();
      if (error == 0)
      {
        Serial.print("I2C device found at address");
        Serial.print(i2c_address[index_address]);
        Serial.println("  !");
        found_address=index_address;
        break;
        
      }
      else
      {
        Serial.print("try address");
        Serial.println(i2c_address[index_address]);
      }
    }
    
    if(mcp.begin(i2c_address[found_address], &MCP4728_I2C)==false)
    {
      Serial.println("Couldn't find MCP4728, will not have analog output");
      MCP_status=false;
    }
    else
    {
      Serial.println("MCP4728 founded");
      MCP_status=true;
      //MCP.begin();
    }
    
  #endif
        
  //initialize time_record
  uint8_t pedalIDX;
  for(pedalIDX=0;pedalIDX<3;pedalIDX++)
  {
    pedal_last_update[pedalIDX]=millis();
  }
  #ifdef LED_ENABLE_WAVESHARE
    pixels.begin();
    pixels.setBrightness(20);
    pixels.setPixelColor(0,0xff,0xff,0xff);
    pixels.show();
    xTaskCreatePinnedToCore(
                          LED_Task,   
                          "LED_update_Task", 
                          3000,  
                          //STACK_SIZE_FOR_TASK_2,    
                          NULL,      
                          1,         
                          &Task3,    
                          0);     
    delay(500);
  #endif
  #ifdef LED_ENABLE_DONGLE
    pixels.begin();
    pixels.setBrightness(20);
    pixels.setPixelColor(0,0xff,0xff,0xff);
    pixels.show();
    xTaskCreatePinnedToCore(
                          LED_Task_Dongle,   
                          "LED_update_Task", 
                          3000,  
                          //STACK_SIZE_FOR_TASK_2,    
                          NULL,      
                          1,         
                          &Task3,    
                          0);     
    delay(500);
  #endif
  #ifdef Fanatec_comunication
    // Initialize FanatecInterface
    fanatec.begin();

    // Set connection callback
    fanatec.onConnected([](bool connected) {        
      if (connected) {
        Serial.println("[L] FANATEC Connected to Wheelbase.");
      } else {
        Serial.println("[L] FANATEC Disconnected from Wheelbase.");
      }
    });
    delay(2000);
    xTaskCreatePinnedToCore(
                          FanatecUpdate,   
                          "Fanatec_update_Task", 
                          3000,  
                          //STACK_SIZE_FOR_TASK_5,    
                          NULL,      
                          1,         
                          &Task5,    
                          1);     
    delay(500);
  #endif
  Serial.println("[L]Setup end");
  
