ziyiz/DIY-Sim-Racing-FFB-Pedal-Customed/ESP32_master/src/Main.cpp
}








/**********************************************************************************************/
/*                                                                                            */
/*                         Main function                                                      */
/*                                                                                            */
/**********************************************************************************************/
uint32_t loop_count=0;
bool basic_rssi_update=false;
unsigned long bridge_state_last_update=millis();
unsigned long Pairing_state_start;
unsigned long Pairing_state_last_sending;
uint8_t press_count=0;
uint Pairing_timeout=20000;
bool Pairing_timeout_status=false;
bool building_dap_esppairing_lcl =false;
void loop() 
{
  taskYIELD();
  //fanatecUpdate();

  //delay(2); 
}

void ESPNOW_SyncTask( void * pvParameters )
{
  for(;;)
  {
    #ifdef ESPNow_Pairing_function
      if(digitalRead(Pairing_GPIO)==LOW||software_pairing_action_b)
      {
        Serial.println("[L]Bridge Pairing.....");
        delay(1000);
        Pairing_state_start=millis();
        Pairing_state_last_sending=millis();
        ESPNow_pairing_action_b=true;
        building_dap_esppairing_lcl=true;
        LED_Status=1;
        software_pairing_action_b=false;
      }
      if(ESPNow_pairing_action_b)
      {
        unsigned long now=millis();
        //sending package
        if(building_dap_esppairing_lcl)
        {
          uint16_t crc=0;          
          building_dap_esppairing_lcl=false;
          dap_esppairing_lcl.payloadESPNowInfo_._deviceID=deviceID;
          dap_esppairing_lcl.payLoadHeader_.payloadType=DAP_PAYLOAD_TYPE_ESPNOW_PAIRING;
          dap_esppairing_lcl.payLoadHeader_.PedalTag=deviceID;
          dap_esppairing_lcl.payLoadHeader_.version=DAP_VERSION_CONFIG;
          crc = checksumCalculator((uint8_t*)(&(dap_esppairing_lcl.payLoadHeader_)), sizeof(dap_esppairing_lcl.payLoadHeader_) + sizeof(dap_esppairing_lcl.payloadESPNowInfo_));
          dap_esppairing_lcl.payloadFooter_.checkSum=crc;
        }
        if(now-Pairing_state_last_sending>400)
        {
          Pairing_state_last_sending=now;
          ESPNow.send_message(broadcast_mac,(uint8_t *) &dap_esppairing_lcl, sizeof(dap_esppairing_lcl));
        }
        

        //timeout check
        if(now-Pairing_state_start>Pairing_timeout)
        {
          Serial.println("[L]Bridge Timeout!");
          ESPNow_pairing_action_b=false;
          LED_Status=0;
          if(UpdatePairingToEeprom)
          {
            EEPROM.put(EEPROM_offset,_ESP_pairing_reg);
            EEPROM.commit();
            UpdatePairingToEeprom=false;
            
            //list eeprom
            ESP_pairing_reg ESP_pairing_reg_local;
            EEPROM.get(EEPROM_offset, ESP_pairing_reg_local);
            for(int i=0;i<4;i++)
            {
              if(ESP_pairing_reg_local.Pair_status[i]==1)
              {                
                Serial.print("[L]#");
                Serial.print(i);
                Serial.print("Pair: ");
                Serial.print(ESP_pairing_reg_local.Pair_status[i]);
                Serial.printf(" Mac: %02X:%02X:%02X:%02X:%02X:%02X\n", ESP_pairing_reg_local.Pair_mac[i][0], ESP_pairing_reg_local.Pair_mac[i][1], ESP_pairing_reg_local.Pair_mac[i][2], ESP_pairing_reg_local.Pair_mac[i][3], ESP_pairing_reg_local.Pair_mac[i][4], ESP_pairing_reg_local.Pair_mac[i][5]);
              }
            }
            Serial.println("");
            //adding peer
            /*
            for(int i=0; i<4;i++)
            {
              if(_ESP_pairing_reg.Pair_status[i]==1)
              {
                if(i==0)
                {
                  ESPNow.remove_peer(Clu_mac);
                  memcpy(&Clu_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                  delay(300);
                  ESPNow.add_peer(Clu_mac);
                  
                }
                if(i==1)
                {
                  ESPNow.remove_peer(Brk_mac);
                  memcpy(&Brk_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                  delay(300);
                  ESPNow.add_peer(Brk_mac);
                  //Serial.printf("[L]Mac: %02X:%02X:%02X:%02X:%02X:%02X\n", Brk_mac[0], Brk_mac[1], Brk_mac[2], Brk_mac[3], Brk_mac[4], Brk_mac[5]);

                }
                if(i==2)
                {
                  ESPNow.remove_peer(Gas_mac);
                  memcpy(&Gas_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                  delay(300);
                  ESPNow.add_peer(Gas_mac);
                }        
                if(i==3)
                {
                  ESPNow.remove_peer(esp_Host);
                  memcpy(&esp_Host,&_ESP_pairing_reg.Pair_mac[i],6);
                  delay(300);
                  ESPNow.add_peer(esp_Host);                
                }        
              }
            }
            */
          }
          
        }
      }
    #endif
    if(configUpdateAvailable)
    {
      if(dap_config_st.payLoadHeader_.PedalTag==0)
      {
        if(dap_bridge_state_st.payloadBridgeState_.Pedal_availability[0]==1)
        {
          ESPNow.send_message(Clu_mac,(uint8_t *) &dap_config_st,sizeof(dap_config_st));
          Serial.println("[L]Clutch config sent");
          configUpdateAvailable=false;
        }
      }
      if(dap_config_st.payLoadHeader_.PedalTag==1)
      {
        if(dap_bridge_state_st.payloadBridgeState_.Pedal_availability[1]==1)
        {
          ESPNow.send_message(Brk_mac,(uint8_t *) &dap_config_st,sizeof(dap_config_st));
          Serial.println("[L]BRK config sent");
          configUpdateAvailable=false;
        }

      }
      if(dap_config_st.payLoadHeader_.PedalTag==2)
      {
        if(dap_bridge_state_st.payloadBridgeState_.Pedal_availability[2]==1)
        {
          ESPNow.send_message(Gas_mac,(uint8_t *) &dap_config_st,sizeof(dap_config_st));
          Serial.println("[L]Throttle config sent");
          configUpdateAvailable=false;
        }

