ziyiz/DIY-Sim-Racing-FFB-Pedal-Customed/ESP32_master/src/Main.cpp
      }

    }


    if(dap_action_update)
    {
      
      if(dap_actions_st.payLoadHeader_.PedalTag==0 && dap_bridge_state_st.payloadBridgeState_.Pedal_availability[0]==1)
      {
        ESPNow.send_message(Clu_mac,(uint8_t *) &dap_actions_st,sizeof(dap_actions_st));
        //Serial.println("BRK sent");
      }
      if(dap_actions_st.payLoadHeader_.PedalTag==1 && dap_bridge_state_st.payloadBridgeState_.Pedal_availability[1]==1)
      {
        ESPNow.send_message(Brk_mac,(uint8_t *) &dap_actions_st,sizeof(dap_actions_st));
        //Serial.println("BRK sent");
      }
                  
      if(dap_actions_st.payLoadHeader_.PedalTag==2 && dap_bridge_state_st.payloadBridgeState_.Pedal_availability[2]==1)
      {
        ESPNow.send_message(Gas_mac,(uint8_t *) &dap_actions_st,sizeof(dap_actions_st));
        //Serial.println("GAS sent");
      }
      
      //ESPNow.send_message(broadcast_mac,(uint8_t *) &dap_actions_st,sizeof(dap_actions_st));
      //Serial.println("Broadcast sent");
      dap_action_update=false;
    }

    delay(2);
  }
}

void Serial_Task( void * pvParameters)
{
  for(;;)
  {  
    uint16_t crc;
    uint16_t n = Serial.available();
    unsigned long current_time=millis();
    if(current_time-bridge_state_last_update>200)
    {
      basic_rssi_update=true;
      bridge_state_last_update=millis();
    }

    bool structChecker = true;
    if (n > 0)
    {
      switch (n) 
      {
        case sizeof(DAP_actions_st) :            
          Serial.readBytes((char*)&dap_actions_st, sizeof(DAP_actions_st));
          

          if ( dap_actions_st.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_ACTION )
          { 
            structChecker = false;
            Serial.print("[L]Payload type expected: ");
            Serial.print(DAP_PAYLOAD_TYPE_ACTION);
            Serial.print(",   Payload type received: ");
            Serial.println(dap_config_st_local.payLoadHeader_.payloadType);
          }
          if ( dap_actions_st.payLoadHeader_.version != DAP_VERSION_CONFIG )
          { 
            structChecker = false;
            Serial.print("[L]Config version expected: ");
            Serial.print(DAP_VERSION_CONFIG);
            Serial.print(",   Config version received: ");
            Serial.println(dap_config_st_local.payLoadHeader_.version);
          }
          
          crc = checksumCalculator((uint8_t*)(&(dap_actions_st.payLoadHeader_)), sizeof(dap_actions_st.payLoadHeader_) + sizeof(dap_actions_st.payloadPedalAction_));
          if (crc != dap_actions_st.payloadFooter_.checkSum)
          { 
            structChecker = false;
            Serial.print("[L]CRC expected: ");
            Serial.print(crc);
            Serial.print(",   CRC received: ");
            Serial.println(dap_actions_st.payloadFooter_.checkSum);
          }
          if (structChecker == true)
          {
            dap_action_update=true;                
          }
          break;

        case sizeof(DAP_config_st):
                
          DAP_config_st * dap_config_st_local_ptr;
          dap_config_st_local_ptr = &dap_config_st;
          Serial.readBytes((char*)dap_config_st_local_ptr, sizeof(DAP_config_st));        
          // check if data is plausible          
          if ( dap_config_st.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_CONFIG )
          { 
            structChecker = false;
            Serial.print("[L]Payload type expected: ");
            Serial.print(DAP_PAYLOAD_TYPE_CONFIG);
            Serial.print(",   Payload type received: ");
            Serial.println(dap_config_st_local.payLoadHeader_.payloadType);
          }
          if ( dap_config_st.payLoadHeader_.version != DAP_VERSION_CONFIG )
          { 
            structChecker = false;
            Serial.print("[L]Config version expected: ");
            Serial.print(DAP_VERSION_CONFIG);
            Serial.print(",   Config version received: ");
            Serial.println(dap_config_st_local.payLoadHeader_.version);
          }
              // checksum validation
          crc = checksumCalculator((uint8_t*)(&(dap_config_st.payLoadHeader_)), sizeof(dap_config_st.payLoadHeader_) + sizeof(dap_config_st.payLoadPedalConfig_));
          if (crc != dap_config_st.payloadFooter_.checkSum)
          { 
            structChecker = false;
            Serial.print("[L]CRC expected: ");
            Serial.print(crc);
            Serial.print(",   CRC received: ");
            Serial.println(dap_config_st.payloadFooter_.checkSum);
          }
          // if checks are successfull, overwrite global configuration struct
          if (structChecker == true)
          {
                //Serial.println("Updating pedal config");
            configUpdateAvailable = true;     
                //memcpy(&dap_config_st, &dap_config_st_local, sizeof(dap_config_st));     
          }
          break;

        case sizeof(DAP_bridge_state_st) : 
          DAP_bridge_state_st * dap_bridge_state_local_ptr;
          dap_bridge_state_local_ptr = &dap_bridge_state_lcl;
          Serial.readBytes((char*)dap_bridge_state_local_ptr, sizeof(DAP_bridge_state_st));        
          // check if data is plausible          
          if ( dap_bridge_state_lcl.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_BRIDGE_STATE )
          { 
            structChecker = false;
            Serial.print("[L]Payload type expected: ");
            Serial.print(DAP_PAYLOAD_TYPE_BRIDGE_STATE);
            Serial.print(",   Payload type received: ");
            Serial.println(dap_bridge_state_lcl.payLoadHeader_.payloadType);
          }
          if ( dap_bridge_state_lcl.payLoadHeader_.version != DAP_VERSION_CONFIG )
          { 
            structChecker = false;
            Serial.print("[L]Config version expected: ");
            Serial.print(DAP_VERSION_CONFIG);
            Serial.print(",   Config version received: ");
            Serial.println(dap_bridge_state_lcl.payLoadHeader_.version);
          }
              // checksum validation
          crc = checksumCalculator((uint8_t*)(&(dap_bridge_state_lcl.payLoadHeader_)), sizeof(dap_bridge_state_lcl.payLoadHeader_) + sizeof(dap_bridge_state_lcl.payloadBridgeState_));
          if (crc != dap_bridge_state_lcl.payloadFooter_.checkSum)
          { 
            structChecker = false;
            Serial.print("[L]CRC expected: ");
            Serial.print(crc);
            Serial.print(",   CRC received: ");
            Serial.println(dap_bridge_state_lcl.payloadFooter_.checkSum);
          }
          // if checks are successfull, overwrite global configuration struct
          if (structChecker == true)
          {
            if(dap_bridge_state_lcl.payloadBridgeState_.Bridge_action==1)
            {
              Serial.println("[L]Bridge Pairing...");
              software_pairing_action_b=true;
            }
            //action=2, restart
            if(dap_bridge_state_lcl.payloadBridgeState_.Bridge_action==2)
            {
              Serial.println("[L]Bridge Restart");
              delay(1000);
              ESP.restart();
            }
            if(dap_bridge_state_lcl.payloadBridgeState_.Bridge_action==3)
            {
              //aciton=3 restart into boot mode
              #ifdef Using_Board_ESP32S3
                Serial.println("[L]Bridge Restart into Download mode");
                delay(1000);
                REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
                ESP.restart();
              #endif
              #ifdef Using_Board_ESP32
                Serial.println("[L]Command not supported ");
                delay(1000); 
              #endif

